#include <BotApi.au3>
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; VARS ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
$WindowName = "[CLASS:TJuggClientForm]"     ; Джаггернаут
;
$MouseSpeed = 2                             ; Скорость движения мыши при клике (0-10)
Dim $MouseDefaultPos[2] = [ 14, 109 ]       ; Позиция мыши по умолчанию
$MouseSpeedToDefault = 10
$SleepBeforeClick = 50                      ; Ждать до клика MS
$SleepAfterClick  = 2200                    ; Ждать после клика MS
$SleepBeforeStart = 10                      ; Задержка перед стартом движка
;
Dim $ArrayPixClick[20][3] = [ _             ; Массив только для кликов по найденым пикселям - приоритет у первого найденого
	[0,0,0], _ ; -
	[0,0,0], _ ; -
	[0,0,0], _ ; -
	[0,0,0], _ ; -
	[0,0,0], _ ; -
	[0,0,0], _ ; -
	[857,434,1929580246],  _ ; 6  - ВЫХОД - кнопка выхода из боя
	[0,0,0], _ ; -
	[1316,562,4018607459], _ ; 8  - Озерная гарпина[13] в Лазурной заводи - АТАКА
	[0,0,0], _ ; -
	[906,608,1952786184],  _ ; 10 - Активна магия перчатки
	[638,543,1637751339],  _ ; 11 - Желтая кнопка атаки слева
	[795,512,1165760402],  _ ; 12 - Желтая кнопка атаки прямой
	[959,547,3050244290],  _ ; 13 - Желтая кнопка атаки справа
	[0,0,0], _ ; -
	[0,0,0], _ ; -
	[0,0,0], _ ; -
	[440,464,3170831070],  _ ; 17 - Кнопка Вход(с авторизацией)
	[430,488,295572010],   _ ; 18 - Кнопка Вход
	[0,0,0]  _ ; -
]
Dim $ArrayLogic[20][3] = [ _             ; Массив для логики
	[0,0,0], _ ; -
	[0,0,0], _ ; -
	[0,0,0], _ ; -
	[0,0,0], _ ; -
	[0,0,0], _ ; -
	[0,0,0], _ ; -
	[213,268,1218910586],  _ ; 6  - У персонажа HP опустилось меньше 25%
	[290,267,541988714],   _ ; 7  - У персонажа HP опустилось меньше 50%
	[1205,305,1867716924], _ ; 8  - В бой вмешался второй моб - появилась полоска HP ниже первого моба
	[0,0,0], _ ; -
	[447,273,178592363],   _ ; 10 - Серая бутылка на HP в 1 слоте
	[445,325,2618889371],  _ ; 11 - Серая бутылка на HP в 2 слоте
	[450,371,4162855191],  _ ; 12 - Серая бутылка на HP в 3 слоте
	[447,423,635246832],   _ ; 13 - Серый знак жизни    в 4 слоте
	[450,473,3216643040],  _ ; 14 - Серый знак жизни    в 5 слоте
	[1265,172,1754334297], _ ; 15 - КАЗНЬ - У моба HP готово для казни(его очень мало)
	[0,0,0], _ ; -
	[0,0,0], _ ; -
	[0,0,0], _ ; -
	[0,0,0]  _ ; -
]
Dim $Object[20][3] = [ _             ; Массив координатных объектов
	[797,544],   _ ; 1  - Кнопка включения ярости для казни
	[920,146],   _ ; 2  - Профессии - кнопка в верхнем меню
	[0,0], _ ; -
	[0,0], _ ; -
	[0,0], _ ; -
	[0,0], _ ; -
	[0,0], _ ; -
	[0,0], _ ; -
	[0,0], _ ; -
	[0,0], _ ; -
	[0,0], _ ; -
	[0,0], _ ; -
	[0,0], _ ; -
	[0,0], _ ; -
	[0,0], _ ; -
	[0,0], _ ; -
	[0,0], _ ; -
	[0,0], _ ; -
	[0,0], _ ; -
	[0,0]  _ ; -
]
;
$FightCounter = 0
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; FUNCTIONS ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

func LogicBeforeClick( $i )
	Switch $i

		Case 10 ; Ждем до того, как пальнуть магией
			sleep( 1300 )

		Case Else
	EndSwitch
endfunc

func LogicAfterClick( $i )
	Switch $i

		Case 6 ; Ждем после конца боя
			$FightCounter += 1
			log_( 'Бой №' & $FightCounter & ' завершен!', 1 )
			sleep( 4000 )

		Case 17 to 18 ; Вход
			sleep( 15000 )

		Case Else
	EndSwitch
endfunc


func Logic( $i )
	Switch $i

		Case 15 ; Можно казнить - включаем ярость
			clickCPS( $Object, 0 )

		Case 6 ; При HP < 25% хиляемся бутылками
			$SleepAfterClick =  3000
			if PotionsHeal() then return 1

		Case 8 ; При появлении второго моба
			$SleepAfterClick =  3200

			; Хиляемся знаками, если доступны
			ZnakHeal()

			; Хиляемся бутылками при HP < 50%
			if isCPSinDisplay( $ArrayLogic, 7 ) then PotionsHeal()

			return 1

		Case Else
			$SleepAfterClick =  2200
	EndSwitch
endfunc
;
;
;
func PotionsHeal()
	if isCPSinDisplay( $ArrayLogic, 10 ) then
		clickCPS( $ArrayLogic, 10 )
		return true
	elseif isCPSinDisplay( $ArrayLogic, 11 ) then
		clickCPS( $ArrayLogic, 11 )
		return true
	elseif isCPSinDisplay( $ArrayLogic, 12 ) then
		clickCPS( $ArrayLogic, 12 )
		return true
	endif
endfunc

func ZnakHeal()
	if isCPSinDisplay( $ArrayLogic, 13 ) then
		clickCPS( $ArrayLogic, 13 )
		return true
	elseif isCPSinDisplay( $ArrayLogic, 14 ) then
		clickCPS( $ArrayLogic, 14 )
		return true
	endif
endfunc












;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; START ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
INIT()
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; END ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


;local $t[2]=[1,2]
;console( $t )

;sleep(5000)